using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Csharp_LabRab4
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
            ЗАДАНИЕ 1
            Вывести в консоль информацию о сотрудниках в виде таблицы(использовать экранирование символов).
            Колонки: имя сотрудника, название компании(в кавычках), дата устройства на работу(день.месяц.год), сумма продаж(decimal c символом валюты).
            Вывести список из 4 человек: у двух продажи в российских рублях, у двух других -в евро.
            
            ЗАДАНИЕ 2.
            Используя класс StringBuilder сформировать текст, состоящий из 100 строк.Каждая строка длиной от 20 до 100 случайных символов. Записать полученный результат в переменную типа string, вывести результат в консоль.
            */

            // ЗАДАНИЕ 1

        }
    }
}
